{
  "backend/main.mo": "Motoko actor that stores and retrieves signal pattern entries (occurrence and preceding move counts) in a persistent map, fetches and caches CoinGecko crypto prices via HTTP outcalls, and includes access control via MixinAuthorization.",
  "feature_evidence.json": "A feature evidence report mapping feature IDs and titles to the frontend/backend files and components that implement them, along with test IDs and confidence levels.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom property tokens for light and dark themes (background, foreground, accent colors, chart colors, sidebar) used throughout the app.",
  "frontend/index.html": "HTML shell for the PWA that sets viewport/theme meta tags, links the manifest and app icons, mounts the React root div, and registers the service worker on load.",
  "frontend/public/manifest.json": "PWA manifest for CryptoSMC Pro defining the app name, standalone display mode, dark-neon theme/background colors, and icon entries for 192x192 and 512x512 sizes.",
  "frontend/public/service-worker.js": "Service worker that caches the app shell assets for offline use and returns explicit 503 JSON errors for API domain requests (Binance, CoinGecko, ICP) when offline instead of serving stale data.",
  "frontend/src/App.tsx": "Root React component that manages the active tab state and renders the AppHeader, BottomNav, and one of four tab pages (Market, AITrade, Search, Preferences) within a full-screen mobile layout.",
  "frontend/src/components/AppHeader.tsx": "Sticky header component displaying the app wordmark and, when authenticated via Internet Identity, the user's short principal and a logout button.",
  "frontend/src/components/AssetRow.tsx": "Row component for a single Binance ticker showing symbol, price, 24h volume, and a color-coded neon directional badge (green/red/orange) with an animated trend icon.",
  "frontend/src/components/AuthGate.tsx": "Wrapper component that shows a loading spinner while initializing, an Internet Identity login prompt when unauthenticated, or renders its children when the user is authenticated.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with four tabs (Market, AI Trade, Search, Settings) using lucide icons, highlighting the active tab with neon-green styling and a pulse indicator.",
  "frontend/src/components/ErrorBanner.tsx": "Displays a styled error banner with an alert icon, a message, and an optional retry button.",
  "frontend/src/components/PositionRow.tsx": "Renders a single Binance futures position card showing entry/mark price, unrealized P&L, liquidation price, leverage, and direction (long/short) with alert highlighting when P&L exceeds a threshold.",
  "frontend/src/components/RecommendationCard.tsx": "Displays an asset analysis card with recommendation label, signal strength bar, SMC signal badges, favorite toggle, and optional global score, styled with neon color coding per recommendation type.",
  "frontend/src/components/SignalBadge.tsx": "Renders a compact colored badge for an SMC signal type (OrderBlock, FVG, BOS, CHoCH, LiquidityZone) showing its label, direction arrow, and optional confidence score.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useFavorites.ts": "Custom hook that manages a list of favorite crypto symbols persisted in localStorage, exposing toggle and lookup helpers.",
  "frontend/src/hooks/useGlobalLearning.ts": "Provides React Query hooks to fetch per-symbol pattern scores from the ICP backend, compute a global success-rate score, and record new signal observations with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useLocalLearning.ts": "Custom hook wrapping local-learning library functions to record signal observations, retrieve per-symbol scores, and reset learning data, with a version counter to trigger re-renders on updates.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching Binance futures market tickers, per-symbol tickers, kline/OHLCV data, and CoinGecko prices via an ICP actor.",
  "frontend/src/index.css": "Global stylesheet importing Space Grotesk and JetBrains Mono fonts, defining a dark neon OKLCH color theme via CSS variables, and utility classes for neon glow/border effects.",
  "frontend/src/lib/binance-auth.ts": "Provides utilities for storing/retrieving Binance API credentials in localStorage and making HMAC-SHA256-signed requests to the Binance Futures REST API, including fetching open positions.",
  "frontend/src/lib/local-learning.ts": "Manages a localStorage-backed log of SMC signal observations per symbol, tracking occurrence counts and success rates to compute local reliability scores.",
  "frontend/src/lib/smc-engine.ts": "Implements Smart Money Concepts (SMC) technical analysis engine detecting Order Blocks, Fair Value Gaps, Break of Structure, and liquidity zones from OHLCV candle data.",
  "frontend/src/lib/smc-types.ts": "Defines TypeScript interfaces and types for SMC analysis including OHLCVCandle, SMCSignal, SwingPoint, StructureBreak, and AssetAnalysis.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AITradeTab.tsx": "Renders AI trade analysis cards for a whitelisted set of crypto symbols, running SMC analysis on fetched kline data and displaying recommendations sorted by favorites.",
  "frontend/src/pages/MarketTab.tsx": "Displays a searchable, sortable list of Binance market ticker pairs with gainers/losers stats, using the useMarketTickers hook and AssetRow components.",
  "frontend/src/pages/PreferencesTab.tsx": "Settings page for managing favorite assets, Binance API credentials, PnL alert toggles, and resetting local learning data.",
  "frontend/src/pages/SearchTab.tsx": "Symbol search page that runs SMC analysis on fetched kline data and displays trade recommendations alongside live Binance open positions via polling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark-mode theme with custom neon color palette, Space Grotesk/JetBrains Mono fonts, neon box shadows, and custom keyframe animations.",
  "project_state.json": "Defines the overall project state (version 3) for CryptoSMC Pro, a mobile-first PWA for Binance USD-M perpetual futures with React/TypeScript frontend, ICP/Motoko backend, and Internet Identity auth. Documents architectural notes, existing features, known issues, and image requirements."
}