{
  "backend/main.mo": "Motoko actor that stores and retrieves signal pattern entries (occurrence and preceding-move counts) in a persistent map, and fetches/caches CoinGecko crypto prices via HTTP outcalls. Includes access control via a mixin and stable upgrade hooks.",
  "feature_evidence.json": "Feature evidence report documenting a single feature fix: updating the service worker to never intercept external API domains when online, only returning a 503 when the device is genuinely offline.",
  "frontend-file-summaries.txt": "A JSON snippet summarizing the service-worker.js file's behavior: caches app-shell assets and bypasses interception for external API domains when online, returning 503 only when offline.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines CSS custom properties for light and dark theme color tokens (background, foreground, chart colors, sidebar, etc.).",
  "frontend/index.html": "HTML entry point for the CryptoSMC Pro PWA, linking the manifest, app icons, and main TSX module, and registering the service worker on load.",
  "frontend/public/manifest.json": "PWA web app manifest for CryptoSMC Pro, defining app name, icons, display mode, theme colors, and categories.",
  "frontend/public/service-worker.js": "PWA service worker that caches app-shell assets using a cache-first strategy and passes through all external API domain requests directly to the network when online, returning a 503 JSON error only when the device is offline.",
  "frontend/src/App.tsx": "Root React component that manages tab navigation state and renders the appropriate tab page (Market, AITrade, Search, Preferences) along with the header, bottom nav, and toast notifications.",
  "frontend/src/components/AppHeader.tsx": "Sticky app header component that displays the CryptoSMC Pro wordmark and, when authenticated, shows the user's short principal and a logout button.",
  "frontend/src/components/AssetRow.tsx": "Displays a single crypto asset row with symbol, price, volume, and color-coded percentage change with directional icons for use in market lists.",
  "frontend/src/components/AuthGate.tsx": "Wraps children behind an Internet Identity authentication check, showing a login prompt or loading spinner when the user is not authenticated.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with four tabs (Market, AI Trade, Search, Settings) that highlights the active tab with neon styling.",
  "frontend/src/components/ErrorBanner.tsx": "Displays a styled error message banner with an optional retry button for surfacing errors in the UI.",
  "frontend/src/components/PositionRow.tsx": "Renders a single Binance futures position card showing symbol, direction (long/short), leverage, entry/mark/liquidation prices, and unrealized P&L with alert highlighting when P&L exceeds a threshold.",
  "frontend/src/components/RecommendationCard.tsx": "Displays an SMC asset analysis card with recommendation label, signal strength bar, direction icon, favorite toggle, and a list of signal badges.",
  "frontend/src/components/SignalBadge.tsx": "Small inline badge component that renders an SMC signal type (OrderBlock, FVG, BOS, etc.) with direction arrow and confidence score, color-coded by signal type.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useFavorites.ts": "React hook that manages a persisted list of favorite trading symbols in localStorage, exposing toggle and lookup helpers.",
  "frontend/src/hooks/useGlobalLearning.ts": "React Query hooks for fetching per-symbol pattern scores from the ICP backend and recording new signal observations, with a derived helper that computes a 0–100 success-rate score.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context (login, clear, status) via a React context and AuthClient, with helpers to persist and validate delegated identities across page reloads.",
  "frontend/src/hooks/useLocalLearning.ts": "React hook wrapping the local-learning library to record signal observations and retrieve per-symbol scores from localStorage, with a version counter to trigger re-renders on updates.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching Binance Futures market tickers, per-symbol tickers, OHLCV klines, and CoinGecko prices via the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind directives, and defines a dark neon theme using OKLCH CSS custom properties for colors, along with utility classes for neon glow effects and app layout.",
  "frontend/src/lib/binance-auth.ts": "Provides utilities for Binance Futures API authentication, including HMAC-SHA256 signing, credential storage/retrieval via localStorage, and a signed fetch helper plus a function to fetch open positions.",
  "frontend/src/lib/local-learning.ts": "Manages local browser storage of signal pattern observations, tracking occurrence and success counts per symbol/signal type to compute local reliability scores.",
  "frontend/src/lib/smc-engine.ts": "Implements Smart Money Concepts (SMC) technical analysis engine that detects Order Blocks, Fair Value Gaps (FVG), Break of Structure (BOS), and liquidity zones from OHLCV candle data.",
  "frontend/src/lib/smc-types.ts": "Defines TypeScript interfaces and types for the SMC analysis system, including OHLCVCandle, SMCSignal, SwingPoint, StructureBreak, and AssetAnalysis.",
  "frontend/src/main.tsx": "React application entry point that mounts the app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AITradeTab.tsx": "AI trade analysis page that fetches 1H kline data for a whitelisted set of crypto pairs, runs SMC analysis on each, and renders recommendation cards sorted by favorites.",
  "frontend/src/pages/MarketTab.tsx": "Market overview page displaying Binance ticker data with search filtering and sorting by volume, price change, or price, along with gainer/loser counts.",
  "frontend/src/pages/PreferencesTab.tsx": "React page for user preferences including favorite asset selection, PnL alert toggling, Binance API key management, and local learning data reset with confirmation dialog.",
  "frontend/src/pages/SearchTab.tsx": "React page allowing users to search any Binance symbol for SMC analysis, view a recommendation card, and display open Binance futures positions using stored API credentials with polling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with sessionStorage persistence helpers and a function to remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the dark-neon design system including oklch-based color tokens, neon palette, custom fonts (Space Grotesk, JetBrains Mono), border radii, box shadows, and keyframe animations.",
  "project_state.json": "Project state document describing the architecture, features, known issues, and tech stack of a mobile-first crypto PWA using React/TypeScript frontend with ICP/Motoko backend, SMC algorithms, and Binance API integration."
}